---
kind: type
id: T:Autodesk.Revit.DB.Lighting.CustomInitialColor
source: html/b08ddf7b-2264-9067-2be7-cfc771872db5.htm
---
# Autodesk.Revit.DB.Lighting.CustomInitialColor

This class encapsulates a custom initial lighting color.

## Syntax (C#)
```csharp
public class CustomInitialColor : InitialColor
```

## Remarks
This color is called an initial color because a color filter can also be added to modify the color.